-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: localhost    Database: dbteam5
-- ------------------------------------------------------
-- Server version	5.7.19-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `articles`
--

DROP TABLE IF EXISTS `articles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `articles` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(100) NOT NULL,
  `content` longtext NOT NULL,
  `last_modified_time` datetime(6) NOT NULL,
  `create_time` datetime(6) NOT NULL,
  `membername` varchar(30) NOT NULL,
  `memberid` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `memberid_idx` (`memberid`),
  CONSTRAINT `memberid` FOREIGN KEY (`memberid`) REFERENCES `members` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=212 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `articles`
--

LOCK TABLES `articles` WRITE;
/*!40000 ALTER TABLE `articles` DISABLE KEYS */;
INSERT INTO `articles` VALUES (1,'測試1','第一篇文章','2018-09-20 07:56:36.641570','2018-09-21 12:27:10.641570','ok',1),(2,'測試2','第2篇文章','2018-09-22 12:57:06.766471','2018-09-21 12:57:06.766471','IsTree',1),(5,'測試3','送出後關閉','2018-09-22 13:03:15.964895','2018-09-22 13:03:15.964895','IsTree',1),(7,'Test4 ','送出後關閉，\n而且還要改變按鈕的文字','2018-09-22 13:10:12.839805','2018-09-22 13:10:12.840800','IsTree',1),(8,'Test5','送出後 要清空文字','2018-09-22 13:14:40.747871','2018-09-22 13:14:40.747871','IsTree',1),(9,'test5','送出後清空文字','2018-09-22 13:15:25.084918','2018-09-22 13:15:25.084918','IsTree',1),(10,'改變Class','alter table name to articles','2018-09-22 13:17:02.959496','2018-09-22 13:17:02.959496','IsTree',1),(11,'After migrate','GOOD','2018-09-22 13:19:03.001563','2018-09-22 13:19:03.001563','IsTree',1),(12,'QQQQ','12345','2018-09-22 13:24:27.936736','2018-09-22 13:24:27.936736','IsTree',1),(13,'嘿嘿','測試時間','2018-09-22 17:14:38.153971','2018-09-22 17:14:38.153971','IsTree',1),(14,'明天醒來要測試時間','測試時間哦','2018-09-22 17:42:45.380171','2018-09-22 17:42:45.380171','IsTree',1),(15,'完成了~時間測試!!  ','不曉得天數如何耶!','2018-09-22 18:01:59.332960','2018-09-22 18:01:59.332960','IsTree',1),(16,'測試 json1','json','2018-09-23 01:57:06.966612','2018-09-23 01:57:06.966612','IsTree',1),(17,'Testing json2','json2','2018-09-23 02:00:44.249881','2018-09-23 02:00:44.249881','IsTree',1),(61,'完成ajax技術發佈文章','可以發佈訊息並且不用刷新整個頁面','2018-09-23 03:20:09.536687','2018-09-23 03:20:09.536687','IsTree',1),(62,'修正~','待會要修改 ajax刷新後的顯示時間','2018-09-23 03:24:58.964827','2018-09-23 03:24:58.964827','IsTree',1),(77,'沒想到serializers...','序列化只能直接操作資料庫裡面的資料，沒辦法把資料庫資料先讀取出來做加工再以加工過的資料去序列化。\n我只好再Javascript再轉換一次時間了...','2018-09-23 06:02:42.312277','2018-09-23 06:02:42.312277','IsTree',1),(78,'完成前端的時間計算','都是serializers 不能對資料庫的資料加工，所以我完成了前端對於資料庫裡面的UTC時間 做轉換再去計算時間差，方能正確顯示發佈文章是多久以前。','2018-09-23 07:07:54.939116','2018-09-23 07:07:54.939116','IsTree',2),(79,'測試不滿1000000分鐘的文章','如何??','2018-09-23 07:11:19.448343','2018-09-23 07:11:19.448343','IsTree',2),(80,'為了ajax','為了不刷新整個頁面來更新文章，server端的資料庫資訊沒辦法加工好再以序列化的方式傳送到client端，因此在client端接收好資訊再去對時間做處理加工!','2018-09-23 07:13:49.098207','2018-09-23 07:13:49.098207','IsTree',2),(81,'倒數60秒','看看分鐘有沒有加1','2018-09-23 07:16:51.722479','2018-09-23 07:16:51.722479','IsTree',2),(83,'時間刷新 有問題!','解決.. \n因為原本把now 放到function外面， 所以now 不會因為執行到function而被更新，難怪顯示還是舊的時間。','2018-09-23 07:21:00.716183','2018-09-23 07:21:00.716183','IsTree',2),(84,'github push完','繼續測試看看有沒有問題','2018-09-23 07:26:35.079504','2018-09-23 07:26:35.079504','IsTree',2),(85,'吃完烤肉再來留個言~','觀察時間','2018-09-23 11:07:41.740704','2018-09-23 11:07:41.740704','IsTree',2),(145,'新增完文章我只更新一筆資料','新增文章之後，我只讀取資料庫裡面最後一筆資料，用prepend的方式插入到文章區塊。','2018-09-23 13:33:04.447706','2018-09-23 13:33:04.447706','IsTree',2),(146,'測試只更新一筆資料','可行嗎??  可以唷','2018-09-23 13:38:50.017466','2018-09-23 13:38:50.017466','IsTree',2),(147,'成功囉~','時間顯示也ok了!','2018-09-23 13:39:05.824620','2018-09-23 13:39:05.824620','IsTree',2),(148,'um..','只更新一筆資料的話，\n底下文章的時間就不會更新了耶....除非重新整理頁面@@~','2018-09-23 13:40:57.943134','2018-09-23 13:40:57.943134','IsTree',2),(151,'I think is ok','應該換回更新全部比較好，未來再想辦法改成滾輪往下滾，顯示10筆，再顯示10筆這樣~','2018-09-23 13:44:31.299610','2018-09-23 13:44:31.299610','IsTree',2),(153,'wiat for 60 secs','Let\'s check the create_time are really be refreshed','2018-09-23 13:47:19.204068','2018-09-23 13:47:19.204068','IsTree',2),(165,'今天重新建立 Ubuntu ','架設網站完成，\n可惜沒有實體ip，無法從外部連線進來','2018-09-24 12:56:25.844860','2018-09-24 12:56:25.844860','IsTree',2),(166,'明天觀察時間','sleep~','2018-09-24 14:34:32.206245','2018-09-24 14:34:32.206245','IsTree',2),(167,'探討jQuery.ajax() return的資料','為什麼$.ajax() 回傳的資料 只能傳出數字啊!!???\n數字以外一律不行...!\n我還不如用$.get()\n但是 $.get() 老師說會有字數上的限制!!\n所以想換成 $.post()，但是Django會有csrf的機制， \n我才用$.ajax的POST\n...','2018-09-25 06:08:51.647818','2018-09-25 06:08:51.647818','IsTree',2),(168,'聊天機器人購物車流程 :','1. default dialog --> mainMenu\n2.mainMenu裡面 選擇 :\n    (1) 飲料\n    (2) 餐飲\n    (3) 結帳\n3.選飲料、餐飲會持續loop mainMenu dialog\n4.選擇結帳 會replaceDialog 到結帳\n5.問完 shipments 資訊後，打印出訊息 並結束對話。','2018-09-26 05:41:04.284418','2018-09-26 05:41:04.284418','IsTree',2),(169,'胡亂發文','asdiqhwdlhlasdhpasiuhdauisdh\nasdkhjasdjas\nahsdhaskjd\nasdh;\n','2018-09-26 05:41:48.053479','2018-09-26 05:41:48.053479','IsTree',2),(173,'ert','ert','2018-09-26 05:44:49.174353','2018-09-26 05:44:49.174353','IsTree',2),(174,'早上8點又去繳交文件....','怎麼這麻煩凡@@，都要去就業處報到...?','2018-09-27 05:59:30.061327','2018-09-27 05:59:30.061327','IsTree',2),(183,'限制文章數量','之後要改變文章顯示數量 ~~~~','2018-10-03 08:18:54.644677','2018-10-03 08:18:54.645678','IsTree',2),(186,'dfg','update~','2018-10-04 04:42:00.864377','2018-10-04 04:42:00.864377','IsTree',2),(189,'123','123','2018-10-08 07:55:11.308839','2018-10-08 07:55:11.309838','IsTree',3),(190,'i am talking','say something\n','2018-10-08 07:57:43.447442','2018-10-08 07:57:43.447442','IsTree',3),(191,'ok','ok','2018-10-08 07:59:44.504481','2018-10-08 07:59:44.504481','IsTree',3),(195,'12','3123','2018-10-08 08:02:44.494383','2018-10-08 08:02:44.494383','IsTree',3),(196,'123','123213','2018-10-08 08:03:01.110805','2018-10-08 08:03:01.110805','IsTree',3),(197,'qweqw','eqweqwe','2018-10-08 08:44:34.475145','2018-10-08 08:44:34.475145','IsTree',3),(198,'58','58','2018-10-08 08:52:18.410521','2018-10-08 08:52:18.410521','IsTree',3),(199,'ert','ertret','2018-10-08 08:52:58.852347','2018-10-08 08:52:58.852347','IsTree',3),(200,'rtret','retret','2018-10-08 08:53:21.810241','2018-10-08 08:53:21.810241','IsTree',3),(201,'ergregreg','erg','2018-10-08 08:55:15.428500','2018-10-08 08:55:15.428500','IsTree',3),(202,'tyu','tyu','2018-10-08 09:18:50.044975','2018-10-08 09:18:50.044975','IsTree',3),(203,'qwe','qwe','2018-10-08 09:19:31.470790','2018-10-08 09:19:31.470790','IsTree',3),(204,'werwer','wer','2018-10-08 09:19:37.727979','2018-10-08 09:19:37.727979','IsTree',3),(205,'可以編輯嗎?','oh YESS!!!!!','2018-10-08 09:19:49.873488','2018-10-08 09:19:49.873488','IsTree',3),(206,'erge','okok','2018-10-08 09:20:19.515639','2018-10-08 09:20:19.515639','IsTree',3),(207,'aa','look?\n','2018-10-08 09:21:27.408630','2018-10-08 09:21:27.408630','IsTree',3),(209,'ghjghjg','hjghjghj','2018-10-08 09:29:31.926795','2018-10-08 09:29:31.926795','IsTree',3),(210,'oooo','ooooossss','2018-10-08 09:35:59.997759','2018-10-08 09:35:59.997759','IsTree',4),(211,'i am 123','ok 123','2018-10-08 09:36:28.542698','2018-10-08 09:36:28.542698','IsTree',4);
/*!40000 ALTER TABLE `articles` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-10-08 17:37:45
